In [1]:

import pandas as pd
import re

In [2]:

bank_statement_df = pd.read_excel(r"D:\NPS_phase1\nps-reconciliation\output\BANK STMT PHASE 4\Bank_Agriculture.xlsx", skiprows=8)

In [3]:
bank_statement_df.head()

,S.NO,Nepali Value Date,Value Date,Nepali Booking Date,Booking Date,Trans Ref,Narrative,DEBIT,CREDIT,Balance,Total Turnover
0,NaN,NaN,NaN,NaN,NaN,NaN,Balance at Period Start,NaN,NaN,"'-15,696,883.94'",NaN
1,1.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246LK86L,100004007250,0,3720.0,"'-15,693,163.94'",NaN
2,2.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246JJ1KK,NPS-IF-3173579,"'-3,200.00'",0.0,"'-15,696,363.94'",NaN
3,3.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246GM2PX,NPS-IF-3173632,"'-16,397.00'",0.0,"'-15,712,760.94'",NaN
4,4.0,20800517.0,20230903.0,20800517.0,20230903.0,FT232466JKSK,100004007311,0,500.0,"'-15,712,260.94'",NaN

In [4]:
bank_statement_df.drop(bank_statement_df.index[0],inplace=True)
bank_statement_df.drop(bank_statement_df.index[-1], inplace=True)
bank_statement_df["DEBIT"] = bank_statement_df["DEBIT"].str.replace("'","").str.replace(",","")
bank_statement_df["DEBIT"].fillna("0.0", inplace=True)
bank_statement_df

,S.NO,Nepali Value Date,Value Date,Nepali Booking Date,Booking Date,Trans Ref,Narrative,DEBIT,CREDIT,Balance,Total Turnover
1,1.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246LK86L,100004007250,0.0,3720.0,"'-15,693,163.94'",NaN
2,2.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246JJ1KK,NPS-IF-3173579,-3200.00,0.0,"'-15,696,363.94'",NaN
3,3.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246GM2PX,NPS-IF-3173632,-16397.00,0.0,"'-15,712,760.94'",NaN
4,4.0,20800517.0,20230903.0,20800517.0,20230903.0,FT232466JKSK,100004007311,0.0,500.0,"'-15,712,260.94'",NaN
5,5.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246G6HR0,100004007331,0.0,300.0,"'-15,711,960.94'",NaN
...,...,...,...,...,...,...,...,...,...,...,...
428,428.0,20800518.0,20230904.0,20800518.0,20230904.0,FT2324707W4L,NPS-IF-3186339,-1300.00,0.0,"'-18,922,204.40'",NaN
429,429.0,20800518.0,20230904.0,20800518.0,20230904.0,FT232474CPHV,NPS-IF-3186360,-18000.00,0.0,"'-18,940,204.40'",NaN
430,430.0,20800518.0,20230904.0,20800518.0,20230904.0,FT23247H4FWS,NPS-IF-3186379,-3000.00,0.0,"'-18,943,204.40'",NaN
431,431.0,20800518.0,20230904.0,20800518.0,20230904.0,FT23247YMM5P,NPS-IF-3186436,-190.00,0.0,"'-18,943,394.40'",NaN
432,432.0,20800518.0,20230904.0,20800518.0,20230904.0,FT232472WNM1,100004013843,0.0,1000.0,"'-18,942,394.40'",NaN

In [14]:
bank_statement_df['DEBIT']= bank_statement_df['DEBIT'].astype(float)

In [15]:
for index, row in bank_statement_df.iterrows():
    if "NPS-IF-" in str(row["Narrative"]):
        id = re.findall(r'[0-9]{7}',str(row["Narrative"]))
        bank_statement_df.loc[index, 'Transaction ID'] = id[0]

    elif "10000" in str(row["Narrative"]):
        id = re.findall(r'10*[0-9]{7}',str(row["Narrative"]))
        bank_statement_df.loc[index, 'Transaction ID'] = id[0].replace("10000","")
    
    elif "FTMS-" in str(row["Narrative"]):
        id = re.findall(r'[0-9]{6}',str(row["Narrative"]))
        bank_statement_df.loc[index, 'Transaction ID'] = id[0]
   
        
        # elif re.findall(r'[0-9]{7}', str(row["Narrative"]))[0] in str(row["Narrative"]):
        #     id = re.findall(r'[0-9]{7}', str(row["Narrative"]))
        #     bank_statement_df.loc[index, 'Transaction ID'] = id[0]

In [16]:
def standard_format(row):
        """
        Standardize transaction amount and mode.

        Classify transactions as debit (DR) or credit (CR).
        """
        if abs(row['DEBIT']) > 0:
            mode = 'DR'
            amount = row['DEBIT']
        elif row['CREDIT'] > 0:
            mode = 'CR'
            amount = row['CREDIT']
        else:
            mode = None
            amount = None
        return pd.Series([mode, amount], index=['Mode', 'Amount'])

In [17]:
bank_statement_df[['Mode', 'Amount']] = bank_statement_df.apply(standard_format, axis=1)

In [18]:
bank_statement_df.head()

,S.NO,Nepali Value Date,Value Date,Nepali Booking Date,Booking Date,Trans Ref,Narrative,DEBIT,CREDIT,Balance,Total Turnover,Transaction ID,Mode,Amount
1,1.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246LK86L,100004007250,0.0,3720.0,"'-15,693,163.94'",NaN,4007250,CR,3720.0
2,2.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246JJ1KK,NPS-IF-3173579,-3200.0,0.0,"'-15,696,363.94'",NaN,3173579,DR,-3200.0
3,3.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246GM2PX,NPS-IF-3173632,-16397.0,0.0,"'-15,712,760.94'",NaN,3173632,DR,-16397.0
4,4.0,20800517.0,20230903.0,20800517.0,20230903.0,FT232466JKSK,100004007311,0.0,500.0,"'-15,712,260.94'",NaN,4007311,CR,500.0
5,5.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246G6HR0,100004007331,0.0,300.0,"'-15,711,960.94'",NaN,4007331,CR,300.0

In [7]:
bank_statement_df.columns

Index(['S.NO', 'Nepali Value Date', 'Value Date', 'Nepali Booking Date',
       'Booking Date', 'Trans Ref', 'Narrative', 'DEBIT', 'CREDIT', 'Balance',
       'Total Turnover', 'Transaction ID'],
      dtype='object')

In [6]:
bank_statement_df

,S.NO,Nepali Value Date,Value Date,Nepali Booking Date,Booking Date,Trans Ref,Narrative,DEBIT,CREDIT,Balance,Total Turnover,Transaction ID
1,1.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246LK86L,100004007250,0.0,3720.0,"'-15,693,163.94'",NaN,4007250
2,2.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246JJ1KK,NPS-IF-3173579,-3200.00,0.0,"'-15,696,363.94'",NaN,3173579
3,3.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246GM2PX,NPS-IF-3173632,-16397.00,0.0,"'-15,712,760.94'",NaN,3173632
4,4.0,20800517.0,20230903.0,20800517.0,20230903.0,FT232466JKSK,100004007311,0.0,500.0,"'-15,712,260.94'",NaN,4007311
5,5.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246G6HR0,100004007331,0.0,300.0,"'-15,711,960.94'",NaN,4007331
...,...,...,...,...,...,...,...,...,...,...,...,...
428,428.0,20800518.0,20230904.0,20800518.0,20230904.0,FT2324707W4L,NPS-IF-3186339,-1300.00,0.0,"'-18,922,204.40'",NaN,3186339
429,429.0,20800518.0,20230904.0,20800518.0,20230904.0,FT232474CPHV,NPS-IF-3186360,-18000.00,0.0,"'-18,940,204.40'",NaN,3186360
430,430.0,20800518.0,20230904.0,20800518.0,20230904.0,FT23247H4FWS,NPS-IF-3186379,-3000.00,0.0,"'-18,943,204.40'",NaN,3186379
431,431.0,20800518.0,20230904.0,20800518.0,20230904.0,FT23247YMM5P,NPS-IF-3186436,-190.00,0.0,"'-18,943,394.40'",NaN,3186436
432,432.0,20800518.0,20230904.0,20800518.0,20230904.0,FT232472WNM1,100004013843,0.0,1000.0,"'-18,942,394.40'",NaN,4013843

In [9]:
bank_statement_df['Transaction ID'].count()

429

In [10]:
bank_statement_df['Date'] = pd.to_datetime(bank_statement_df['Value Date'], format="%Y%m%d").dt.date

In [11]:
bank_statement_df.head()

,S.NO,Nepali Value Date,Value Date,Nepali Booking Date,Booking Date,Trans Ref,Narrative,DEBIT,CREDIT,Balance,Total Turnover,Transaction ID,Date
0,NaN,NaN,NaN,NaN,NaN,NaN,Balance at Period Start,0.0,NaN,"'-15,696,883.94'",NaN,NaN,NaT
2,2.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246JJ1KK,NPS-IF-3173579,-3200.00,0.0,"'-15,696,363.94'",NaN,3173579,2023-09-03
3,3.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246GM2PX,NPS-IF-3173632,-16397.00,0.0,"'-15,712,760.94'",NaN,3173632,2023-09-03
4,4.0,20800517.0,20230903.0,20800517.0,20230903.0,FT232466JKSK,100004007311,0.0,500.0,"'-15,712,260.94'",NaN,4007311,2023-09-03
5,5.0,20800517.0,20230903.0,20800517.0,20230903.0,FT23246G6HR0,100004007331,0.0,300.0,"'-15,711,960.94'",NaN,4007331,2023-09-03

In [6]:
bank_statement_df['Transaction ID'].values

array(['2842471', '3808187', '2842598', '2842655', '2842668', '2842687',
       '2842746', '2842768', '2842787', '2842816', '2842840', '2842850',
       '2842857', '2842892', '2842895', '2843049', '2843061', '2843079',
       '2843087', '2843178', '3808502', '3808545', '2843290', '2843301',
       '156685', '156768', '3808604', '156795', '156804', '3808622',
       '156907', '156919', '156932', '2843396', '3808790', '3808868',
       '2843485', '2843496', '2843531', '3808973', '3808983', '2843616',
       '2843628', '2843631', '2843648', '2843689', '2843730', '2843756',
       '2843780', '2843791', '3809194', '2843836', '2843840', '157063',
       '2843865', '2843876', '3809264', '3809333', '2844036', '2844037',
       '157093', '3809395', '2844066', '3809426', '2844146', '2844257',
       '2844268', '3809561', '3809590', '2844384', '2844386', '2844407',
       '3809597', '3809606', '2844441', '2844461', '2844462', '2844463',
       '2844518', '3809690', '2844569', '2844691', '2844739', '2844773',
       '157154', '3809883', '3809903', '2844916', '2844926', '2844937',
       '2844972', '2844974', '2844978', '2844999', '2845001', '2845007',
       '3810039', '2845010', '3810045', '2845030', '2845034', '2845040',
       '2845065', '2845070', '2845113', '2845121', '2845144', '2845173',
       '2845190', '2845253', '2845256', '2845285', '2845312', '2845315',
       '2845371', '2845423', '3810162', '2845480', '3810179',
       'IntS100000027808', '3810225', '2845560', '2845570', '2845588',
       '2845590', '2845634', '2845637', '3810280', '2845661', '2845669',
       '2845671', '2845679', '2845688', '2845690', '3810357', '157237',
       '3810371', '2845755', '2845826', '2845844', '2845851', '3810419',
       '2845868', '3810462', '2845930', '2845932', '2845938', '2845989',
       '2846005', '2846031', '2846039', '2846038', '3810573', '2846055',
       '2846060', '2846070', '2846071', '2846088', '2846094', '2846103',
       '2846123', '2846129', '2846140', '2846174', '2846175', '2846185',
       '157288', '2846187', '2846252', '2846322', '2846321', '2846324',
       '2846326', '2846327', '2846365', '2846492', '2846494', '2846508',
       '3810811', '3810818', '3810824', '3810825', '2846545', '2846559',
       '2846563', '2846580', '2846582', '3810851', '3810925', '2846687',
       '2846702', '2846703', '3810975', '2846723', '2846746', '2846803',
       '2846842', '2846915', '2846965', '2846992', '2846997', '2847048',
       '2847055', '2847119', '2847186', '2847190', '2847213', '2847269',
       '2847306', '2847316', '2847330', '2847333', '3811360', '2847447',
       '2847477', '2847511', '2847525', '3811458', '2847582', '2847622',
       '2847631', '2847635', '2847663', '157381', '2847720', '2847745',
       '3811584', '2847749', '3811589', '3811600', '2847783', '2847784',
       '2847843', '2847854', '2847875', '2847887', '2847888', '3811660',
       '3811661', '3811663', '2847901', '3811666', '2847903', '2847907',
       '3811671', '3811724', '3811727', '2848028', '2848088', '3811778',
       '2848112', '2848117', '157415', '2848155', '3811831', '2848166',
       '3811847', '2848252', '2848266', '2848305', '2848307', '2848320',
       '3811885', '3811915', '3811922', '3811931', '3811936', '3811943',
       '3811950', '157427', '3811978', '2848474', '3812021', '2848532',
       '3812078', '2848593', '2848597', '3812101', '2848631', '2848640',
       '2848665', '3812175', '3812207', '2848696', '3812319', '3812320',
       '2848749', '3812340', '3812344', '2848762', '3812339', '2848801',
       '3812440', '2848822', '3812460', '3812469', '3812477', '2848840',
       '2848853', '2848896', '3812559', '3812671', '3812687', '2849019',
       '2849022', '2849037', '2849040', '3812752', '2849085', '2849133',
       '2849172', '3812891', '2849213', '2849218', '2849254', '2849290',
       '2849299', '2849302', '3812984', '2849327', '2849329', '2849334',
       '2849399', '3813070', '3813127', '3813175', '2849524', '2849532',
       '2849561', '2849596', '2849629', '2849665', '2849672', '3813311',
       '2849694', '3813320', '2849717', '2849734', '2849743', '2849748',
       '157476', '2849816', '2849827', '2849829', '2849848', '3813507',
       '3813582', '3813593', '157514', '3813631', '2849937', '2849949',
       '157531', '3813727', '3813814', '2850049', '2850057', '2850114',
       '3813966', '3813979', '3813990', '3813999', '2850160', '2850169',
       '157616', '2850254', '3814103', '2850289', '3814159', '2850325',
       '157644', '2850355', '2850370', '3814216', '2850406', '2850409',
       '2850450'], dtype=object)